eisup_2019_docmng_integration/src/Documents/абс_ЗадачаТЭО/абс_ЗадачаТЭО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ЗадачаТЭО</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.абс_ВложенияТЭО</registerRecords>
  <registerRecords>InformationRegister.абс_ПерепискаТЭО</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыЗадачТЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТЭО</name>
    <type>
      <types>CatalogRef.абс_ТЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗадачаОснование</name>
    <type>
      <types>DocumentRef.абс_ЗадачаТЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьКонтроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контролер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиСообщений</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ВложенияТЭО/абс_ВложенияТЭО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ВложенияТЭО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Вложение</name>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Documents/абс_ЗадачаТЭО/Forms/ОткрытьВложения/Module.bsl
&НаСервере
Процедура ЗагрузитьТаблицуВложений(НомерСообщения,Регистратор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_ВложенияТЭО.Вложение КАК ФайлВложение,
	|	абс_ВложенияТЭО.Комментарий,
	|	абс_ВложенияТЭО.Вложение.ИмяФайла КАК ИмяФайла
	|ИЗ
	|	РегистрСведений.абс_ВложенияТЭО КАК абс_ВложенияТЭО
	|ГДЕ
	|	абс_ВложенияТЭО.Регистратор = &Регистратор
	|	И абс_ВложенияТЭО.НомерСообщения = &НомерСообщения";
	
	Запрос.УстановитьПараметр("НомерСообщения", НомерСообщения);
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	ТЗВложения.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗагрузитьТаблицуВложений(Параметры.НомерСообщения,Параметры.Регистратор);
КонецПроцедуры

&НаСервере
Функция ПолучитьФайлССервера(СсылкаНаФайл, НаименованиеФайла)
	
	ДвоичныеДанные = абс_РаботаСФайлами.ПолучитьФайлИзВнешнегоХранилища(СсылкаНаФайл);
	
	Если ДвоичныеДанные = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка 
		АдресХранилища = "";	
		АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		
		НаименованиеФайла = СсылкаНаФайл.Наименование;

	Исключение
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Ошибка при получении файла из хранилища.");
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат АдресХранилища;
			
КонецФункции

&НаКлиенте
Процедура ОткрытьФайлФложения()

	Состояние("Загрузка файла...");
	
	СсылкаНаФайл = Элементы.ТЗВложения.ТекущиеДанные.ФайлВложение;
	
	НаименованиеФайла = "";
	
	АдресХран = ПолучитьФайлССервера(СсылкаНаФайл, НаименованиеФайла);
	
	Если АдресХран = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолучитьФайл(АдресХран, НаименованиеФайла, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВложение(Команда)
	ОткрытьФайлФложения();	
КонецПроцедуры

&НаКлиенте
Процедура ТЗВложенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьФайлФложения();
КонецПроцедуры
